/****************************************************************************
*
*    Copyright (c) 2005 - 2020 by Vivante Corp.  All rights reserved.
*
*    The material in this file is confidential and contains trade secrets
*    of Vivante Corporation. This is proprietary information owned by
*    Vivante Corporation. No part of this work may be disclosed,
*    reproduced, copied, transmitted, or used in any way for any purpose,
*    without the express written permission of Vivante Corporation.
*
*****************************************************************************/


#include "gc_cl_emit_code.h"

gceSTATUS
cloCODE_EMITTER_NewBasicBlock(
IN cloCOMPILER Compiler,
IN cloCODE_EMITTER CodeEmitter
);

gceSTATUS
cloCODE_EMITTER_EndBasicBlock(
IN cloCOMPILER Compiler,
IN cloCODE_EMITTER CodeEmitter
);

gceSTATUS
cloCODE_EMITTER_EmitCode1(
IN cloCOMPILER Compiler,
IN cloCODE_EMITTER CodeEmitter,
IN gctUINT LineNo,
IN gctUINT StringNo,
IN cleOPCODE Opcode,
IN gcsTARGET * Target,
IN gcsSOURCE * Source
);

gceSTATUS
cloCODE_EMITTER_EmitCode2(
IN cloCOMPILER Compiler,
IN cloCODE_EMITTER CodeEmitter,
IN gctUINT LineNo,
IN gctUINT StringNo,
IN cleOPCODE Opcode,
IN gcsTARGET * Target,
IN gcsSOURCE * Source0,
IN gcsSOURCE * Source1
);

gctSIZE_T
gcGetDataTypeRegSize(
IN clsGEN_CODE_DATA_TYPE DataType
)
{
    gctUINT8 size;

    size = clmGEN_CODE_matrixColumnCount_GET(DataType);
    if(size == 0) size = 1;
    if(clmIsElementTypePacked(DataType.elementType)) {

           switch (clmGEN_CODE_matrixRowCount_GET(DataType)) {
           case 2:
              typeSize.type = gcSHADER_FLOAT_4X2;
              typeSize.length = 3;
              break;

           case 3:
              typeSize.type = gcSHADER_FLOAT_4X3;
              typeSize.length = 3;
              break;

           case 4:
              typeSize.type = gcSHADER_FLOAT_4X4;
              typeSize.length = 3;
              break;

           case 8:
              typeSize.type = gcSHADER_FLOAT_4X4;
              typeSize.length = 6;
              break;

           case 16:
              typeSize.type = gcSHADER_FLOAT_4X4;
              typeSize.length = 12;
              break;

           default:
              gcmASSERT(0);
           }
           break;

        case 13:
        case 14:
        case 15:
        case 16:
           switch (clmGEN_CODE_matrixRowCount_GET(DataType)) {
           case 2:
              typeSize.type = gcSHADER_FLOAT_4X2;
              typeSize.length = 4;
              break;

           case 3:
              typeSize.type = gcSHADER_FLOAT_4X3;
              typeSize.length = 4;
              break;

           case 4:
              typeSize.type = gcSHADER_FLOAT_4X4;
              typeSize.length = 4;
              break;

           case 8:
              typeSize.type = gcSHADER_FLOAT_4X4;
              typeSize.length = 8;
              break;

           case 16:
              typeSize.type = gcSHADER_FLOAT_4X4;
              typeSize.length = 16;
              break;

           default:
              gcmASSERT(0);
           }
           break;

        default:
           gcmASSERT(0);
        }
        break;

    case clvTYPE_EVENT_T:
        typeSize.type = gcSHADER_INTEGER_X1;
        break;

    case clvTYPE_SAMPLER_T:
        typeSize.type = gcSHADER_SAMPLER_T;
        break;

    case clvTYPE_IMAGE2D_T:
        typeSize.type = gcSHADER_IMAGE_2D_T;
        break;

    case clvTYPE_IMAGE3D_T:
        typeSize.type = gcSHADER_IMAGE_3D_T;
        break;

    case clvTYPE_IMAGE2D_ARRAY_T:
        typeSize.type = gcSHADER_IMAGE_2D_ARRAY_T;
        break;

    case clvTYPE_IMAGE1D_T:
        typeSize.type = gcSHADER_IMAGE_1D_T;
        break;

    case clvTYPE_IMAGE1D_ARRAY_T:
        typeSize.type = gcSHADER_IMAGE_1D_ARRAY_T;
        break;

    case clvTYPE_IMAGE1D_BUFFER_T:
        typeSize.type = gcSHADER_IMAGE_1D_BUFFER_T;
        break;

    case clvTYPE_VIV_GENERIC_IMAGE_T:
        typeSize.type = gcSHADER_VIV_GENERIC_IMAGE_T;
        break;

    case clvTYPE_SAMPLER2D:
        typeSize.type = gcSHADER_SAMPLER_2D;
        break;

    case clvTYPE_SAMPLER3D:
        typeSize.type = gcSHADER_SAMPLER_3D;
        break;

    case clvTYPE_STRUCT:
    case clvTYPE_UNION:
        typeSize.type = gcSHADER_INTEGER_X4;
        break;

    default:
        typeSize.type = gcSHADER_INTEGER_X1;
        break;
    }
    return typeSize;
}

gctCONST_STRING
gcGetShaderDataTypeName(
IN gcSHADER_TYPE Type
)
{
    switch (Type) {
    case gcSHADER_FLOAT_X1:                        return "gcSHADER_FLOAT_X1";                      /* 0x00 */
    case gcSHADER_FLOAT_X2:                        return "gcSHADER_FLOAT_X2";                      /* 0x01 */
    case gcSHADER_FLOAT_X3:                        return "gcSHADER_FLOAT_X3";                      /* 0x02 */
    case gcSHADER_FLOAT_X4:                        return "gcSHADER_FLOAT_X4";                      /* 0x03 */
    case gcSHADER_FLOAT_2X2:                       return "gcSHADER_FLOAT_2X2";                     /* 0x04 */
    case gcSHADER_FLOAT_3X3:                       return "gcSHADER_FLOAT_3X3";                     /* 0x05 */
    case gcSHADER_FLOAT_4X4:                       return "gcSHADER_FLOAT_4X4";                     /* 0x06 */
    case gcSHADER_BOOLEAN_X1:                      return "gcSHADER_BOOLEAN_X1";                    /* 0x07 */
    case gcSHADER_BOOLEAN_X2:                      return "gcSHADER_BOOLEAN_X2";                    /* 0x08 */
    case gcSHADER_BOOLEAN_X3:                      return "gcSHADER_BOOLEAN_X3";                    /* 0x09 */
    case gcSHADER_BOOLEAN_X4:                      return "gcSHADER_BOOLEAN_X4";                    /* 0x0A */
    case gcSHADER_INTEGER_X1:                      return "gcSHADER_INTEGER_X1";                    /* 0x0B */
    case gcSHADER_INTEGER_X2:                      return "gcSHADER_INTEGER_X2";                    /* 0x0C */
    case gcSHADER_INTEGER_X3:                      return "gcSHADER_INTEGER_X3";                    /* 0x0D */
    case gcSHADER_INTEGER_X4:                      return "gcSHADER_INTEGER_X4";                    /* 0x0E */
    case gcSHADER_SAMPLER_1D:                      return "gcSHADER_SAMPLER_1D";                    /* 0x0F */
    case gcSHADER_SAMPLER_2D:                      return "gcSHADER_SAMPLER_2D";                    /* 0x10 */
    case gcSHADER_SAMPLER_3D:                      return "gcSHADER_SAMPLER_3D";                    /* 0x11 */
    case gcSHADER_SAMPLER_CUBIC:                   return "gcSHADER_SAMPLER_CUBIC";                 /* 0x12 */
    case gcSHADER_FIXED_X1:                        return "gcSHADER_FIXED_X1";                      /* 0x13 */
    case gcSHADER_FIXED_X2:                        return "gcSHADER_FIXED_X2";                      /* 0x14 */
    case gcSHADER_FIXED_X3:                        return "gcSHADER_FIXED_X3";                      /* 0x15 */
    case gcSHADER_FIXED_X4:                        return "gcSHADER_FIXED_X4";                      /* 0x16 */

    /* For OCL. */
    case gcSHADER_IMAGE_1D_T:                      return "gcSHADER_IMAGE_1D_T";                    /* 0x17 */
    case gcSHADER_IMAGE_1D_BUFFER_T:               return "gcSHADER_IMAGE_1D_BUFFER_T";             /* 0x18 */
    case gcSHADER_IMAGE_1D_ARRAY_T:                return "gcSHADER_IMAGE_1D_ARRAY_T";              /* 0x19 */
    case gcSHADER_IMAGE_2D_T:                      return "gcSHADER_IMAGE_2D_T";                    /* 0x1A */
    case gcSHADER_IMAGE_2D_ARRAY_T:                return "gcSHADER_IMAGE_2D_ARRAY_T";              /* 0x1B */
    case gcSHADER_IMAGE_3D_T:                      return "gcSHADER_IMAGE_3D_T";                    /* 0x1C */
    case gcSHADER_VIV_GENERIC_IMAGE_T:             return "gcSHADER_VIV_GENERIC_IMAGE_T";           /* 0x1D */
    case gcSHADER_SAMPLER_T:                       return "gcSHADER_SAMPLER_T";                     /* 0x1E */

    case gcSHADER_FLOAT_2X3:                       return "gcSHADER_FLOAT_2X3";                     /* 0x1F */
    case gcSHADER_FLOAT_2X4:                       return "gcSHADER_FLOAT_2X4";                     /* 0x20 */
    case gcSHADER_FLOAT_3X2:                       return "gcSHADER_FLOAT_3X2";                     /* 0x21 */
    case gcSHADER_FLOAT_3X4:                       return "gcSHADER_FLOAT_3X4";                     /* 0x22 */
    case gcSHADER_FLOAT_4X2:                       return "gcSHADER_FLOAT_4X2";                     /* 0x23 */
    case gcSHADER_FLOAT_4X3:                       return "gcSHADER_FLOAT_4X3";                     /* 0x24 */
    case gcSHADER_ISAMPLER_2D:                     return "gcSHADER_ISAMPLER_2D";                   /* 0x25 */
    case gcSHADER_ISAMPLER_3D:                     return "gcSHADER_ISAMPLER_3D";                   /* 0x26 */
    case gcSHADER_ISAMPLER_CUBIC:                  return "gcSHADER_ISAMPLER_CUBIC";                /* 0x27 */
    case gcSHADER_USAMPLER_2D:                     return "gcSHADER_USAMPLER_2D";                   /* 0x28 */
    case gcSHADER_USAMPLER_3D:                     return "gcSHADER_USAMPLER_3D";                   /* 0x29 */
    case gcSHADER_USAMPLER_CUBIC:                  return "gcSHADER_USAMPLER_CUBIC";                /* 0x2A */
    case gcSHADER_SAMPLER_EXTERNAL_OES:            return "gcSHADER_SAMPLER_EXTERNAL_OES";          /* 0x2B */

    case gcSHADER_UINT_X1:                         return "gcSHADER_UINT_X1";                       /* 0x2C */
    case gcSHADER_UINT_X2:                         return "gcSHADER_UINT_X2";                       /* 0x2D */
    case gcSHADER_UINT_X3:                         return "gcSHADER_UINT_X3";                       /* 0x2E */
    case gcSHADER_UINT_X4:                         return "gcSHADER_UINT_X4";                       /* 0x2F */

    case gcSHADER_SAMPLER_2D_SHADOW:               return "gcSHADER_SAMPLER_2D_SHADOW";             /* 0x30 */
    case gcSHADER_SAMPLER_CUBE_SHADOW:             return "gcSHADER_SAMPLER_CUBE_SHADOW";           /* 0x31 */

    case gcSHADER_SAMPLER_1D_ARRAY:                return "gcSHADER_SAMPLER_1D_ARRAY";              /* 0x32 */
    case gcSHADER_SAMPLER_1D_ARRAY_SHADOW:         return "gcSHADER_SAMPLER_1D_ARRAY_SHADOW";       /* 0x33 */
    case gcSHADER_SAMPLER_2D_ARRAY:                return "gcSHADER_SAMPLER_2D_ARRAY";              /* 0x34 */
    case gcSHADER_ISAMPLER_2D_ARRAY:               return "gcSHADER_ISAMPLER_2D_ARRAY";             /* 0x35 */
    case gcSHADER_USAMPLER_2D_ARRAY:               return "gcSHADER_USAMPLER_2D_ARRAY";             /* 0x36 */
    case gcSHADER_SAMPLER_2D_ARRAY_SHADOW:         return "gcSHADER_SAMPLER_2D_ARRAY_SHADOW";       /* 0x37 */

    case gcSHADER_SAMPLER_2D_MS:                   return "gcSHADER_SAMPLER_2D_MS";                 /* 0x38 */
    case gcSHADER_ISAMPLER_2D_MS:                  return "gcSHADER_ISAMPLER_2D_MS";                /* 0x39 */
    case gcSHADER_USAMPLER_2D_MS:                  return "gcSHADER_USAMPLER_2D_MS";                /* 0x3A */
    case gcSHADER_SAMPLER_2D_MS_ARRAY:             return "gcSHADER_SAMPLER_2D_MS_ARRAY";           /* 0x3B */
    case gcSHADER_ISAMPLER_2D_MS_ARRAY:            return "gcSHADER_ISAMPLER_2D_MS_ARRAY";          /* 0x3C */
    case gcSHADER_USAMPLER_2D_MS_ARRAY:            return "gcSHADER_USAMPLER_2D_MS_ARRAY";          /* 0x3D */

    case gcSHADER_IMAGE_2D:                        return "gcSHADER_IMAGE_2D";                      /* 0x3E */
    case gcSHADER_IIMAGE_2D:                       return "gcSHADER_IIMAGE_2D";                     /* 0x3F */
    case gcSHADER_UIMAGE_2D:                       return "gcSHADER_UIMAGE_2D";                     /* 0x40 */
    case gcSHADER_IMAGE_3D:                        return "gcSHADER_IMAGE_3D";                      /* 0x41 */
    case gcSHADER_IIMAGE_3D:                       return "gcSHADER_IIMAGE_3D";                     /* 0x42 */
    case gcSHADER_UIMAGE_3D:                       return "gcSHADER_UIMAGE_3D";                     /* 0x43 */
    case gcSHADER_IMAGE_CUBE:                      return "gcSHADER_IMAGE_CUBE";                    /* 0x44 */
    case gcSHADER_IIMAGE_CUBE:                     return "gcSHADER_IIMAGE_CUBE";                   /* 0x45 */
    case gcSHADER_UIMAGE_CUBE:                     return "gcSHADER_UIMAGE_CUBE";                   /* 0x46 */
    case gcSHADER_IMAGE_2D_ARRAY:                  return "gcSHADER_IMAGE_2D_ARRAY";                /* 0x47 */
    case gcSHADER_IIMAGE_2D_ARRAY:                 return "gcSHADER_IIMAGE_2D_ARRAY";               /* 0x48 */
    case gcSHADER_UIMAGE_2D_ARRAY:                 return "gcSHADER_UIMAGE_2D_ARRAY";               /* 0x49 */
    case gcSHADER_VIV_GENERIC_GL_IMAGE:            return "gcSHADER_VIV_GENERIC_GL_IMAGE";          /* 0x4A */

    case gcSHADER_ATOMIC_UINT:                     return "gcSHADER_ATOMIC_UINT";                   /* 0x4B */

    /* GL_EXT_texture_cube_map_array */
    case gcSHADER_SAMPLER_CUBEMAP_ARRAY:           return "gcSHADER_SAMPLER_CUBEMAP_ARRAY";         /* 0x4C */
    case gcSHADER_SAMPLER_CUBEMAP_ARRAY_SHADOW:    return "gcSHADER_SAMPLER_CUBEMAP_ARRAY_SHADOW";  /* 0x4D */
    case gcSHADER_ISAMPLER_CUBEMAP_ARRAY:          return "gcSHADER_ISAMPLER_CUBEMAP_ARRAY";        /* 0x4E */
    case gcSHADER_USAMPLER_CUBEMAP_ARRAY:          return "gcSHADER_USAMPLER_CUBEMAP_ARRAY";        /* 0x4F */
    case gcSHADER_IMAGE_CUBEMAP_ARRAY:             return "gcSHADER_IMAGE_CUBEMAP_ARRAY";           /* 0x50 */
    case gcSHADER_IIMAGE_CUBEMAP_ARRAY:            return "gcSHADER_IIMAGE_CUBEMAP_ARRAY";          /* 0x51 */
    case gcSHADER_UIMAGE_CUBEMAP_ARRAY:            return "gcSHADER_UIMAGE_CUBEMAP_ARRAY";          /* 0x52 */

    case gcSHADER_INT64_X1:                        return "gcSHADER_INT64_X1";                      /* 0x53 */
    case gcSHADER_INT64_X2:                        return "gcSHADER_INT64_X2";                      /* 0x54 */
    case gcSHADER_INT64_X3:                        return "gcSHADER_INT64_X3";                      /* 0x55 */
    case gcSHADER_INT64_X4:                        return "gcSHADER_INT64_X4";                      /* 0x56 */
    case gcSHADER_UINT64_X1:                       return "gcSHADER_UINT64_X1";                     /* 0x57 */
    case gcSHADER_UINT64_X2:                       return "gcSHADER_UINT64_X2";                     /* 0x58 */
    case gcSHADER_UINT64_X3:                       return "gcSHADER_UINT64_X3";                     /* 0x59 */
    case gcSHADER_UINT64_X4:                       return "gcSHADER_UINT64_X4";                     /* 0x5A */

    /* texture buffer extension type. */
    case gcSHADER_SAMPLER_BUFFER:                  return "gcSHADER_SAMPLER_BUFFER";                /* 0x5B */
    case gcSHADER_ISAMPLER_BUFFER:                 return "gcSHADER_ISAMPLER_BUFFER";               /* 0x5C */
    case gcSHADER_USAMPLER_BUFFER:                 return "gcSHADER_USAMPLER_BUFFER";               /* 0x5D */
    case gcSHADER_IMAGE_BUFFER:                    return "gcSHADER_IMAGE_BUFFER";                  /* 0x5E */
    case gcSHADER_IIMAGE_BUFFER:                   return "gcSHADER_IIMAGE_BUFFER";                 /* 0x5F */
    case gcSHADER_UIMAGE_BUFFER:                   return "gcSHADER_UIMAGE_BUFFER";                 /* 0x60 */
    case gcSHADER_VIV_GENERIC_GL_SAMPLER:          return "gcSHADER_VIV_GENERIC_GL_SAMPLER";        /* 0x61 */

    /* float16 */
    case gcSHADER_FLOAT16_X1:                      return "gcSHADER_FLOAT16_X1";                    /* 0x62 half2 */
    case gcSHADER_FLOAT16_X2:                      return "gcSHADER_FLOAT16_X2";                    /* 0x63 half2 */
    case gcSHADER_FLOAT16_X3:                      return "gcSHADER_FLOAT16_X3";                    /* 0x64 half3 */
    case gcSHADER_FLOAT16_X4:                      return "gcSHADER_FLOAT16_X4";                    /* 0x65 half4 */
    case gcSHADER_FLOAT16_X8:                      return "gcSHADER_FLOAT16_X8";                    /* 0x66 half8 */
    case gcSHADER_FLOAT16_X16:                     return "gcSHADER_FLOAT16_X16";                   /* 0x67 half16 */
    case gcSHADER_FLOAT16_X32:                     return "gcSHADER_FLOAT16_X32";                   /* 0x68 half32 */

    /*  boolean  */
    case gcSHADER_BOOLEAN_X8:                      return "gcSHADER_BOOLEAN_X8";                    /* 0x69 */
    case gcSHADER_BOOLEAN_X16:                     return "gcSHADER_BOOLEAN_X16";                   /* 0x6A */
    case gcSHADER_BOOLEAN_X32:                     return "gcSHADER_BOOLEAN_X32";                   /* 0x6B */

    /* uchar vectors  */
    case gcSHADER_UINT8_X1:                        return "gcSHADER_UINT8_X1";                      /* 0x6C */
    case gcSHADER_UINT8_X2:                        return "gcSHADER_UINT8_X2";                      /* 0x6D */
    case gcSHADER_UINT8_X3:                        return "gcSHADER_UINT8_X3";                      /* 0x6E */
    case gcSHADER_UINT8_X4:                        return "gcSHADER_UINT8_X4";                      /* 0x6F */
    case gcSHADER_UINT8_X8:                        return "gcSHADER_UINT8_X8";                      /* 0x70 */
    case gcSHADER_UINT8_X16:                       return "gcSHADER_UINT8_X16";                     /* 0x71 */
    case gcSHADER_UINT8_X32:                       return "gcSHADER_UINT8_X32";                     /* 0x72 */

    /* char vectors  */
    case gcSHADER_INT8_X1:                         return "gcSHADER_INT8_X1";                       /* 0x73 */
    case gcSHADER_INT8_X2:                         return "gcSHADER_INT8_X2";                       /* 0x74 */
    case gcSHADER_INT8_X3:                         return "gcSHADER_INT8_X3";                       /* 0x75 */
    case gcSHADER_INT8_X4:                         return "gcSHADER_INT8_X4";                       /* 0x76 */
    case gcSHADER_INT8_X8:                         return "gcSHADER_INT8_X8";                       /* 0x77 */
    case gcSHADER_INT8_X16:                        return "gcSHADER_INT8_X16";                      /* 0x78 */
    case gcSHADER_INT8_X32:                        return "gcSHADER_INT8_X32";                      /* 0x79 */

    /* ushort vectors */
    case gcSHADER_UINT16_X1:                       return "gcSHADER_UINT16_X1";                     /* 0x7A */
    case gcSHADER_UINT16_X2:                       return "gcSHADER_UINT16_X2";                     /* 0x7B */
    case gcSHADER_UINT16_X3:                       return "gcSHADER_UINT16_X3";                     /* 0x7C */
    case gcSHADER_UINT16_X4:                       return "gcSHADER_UINT16_X4";                     /* 0x7D */
    case gcSHADER_UINT16_X8:                       return "gcSHADER_UINT16_X8";                     /* 0x7E */
    case gcSHADER_UINT16_X16:                      return "gcSHADER_UINT16_X16";                    /* 0x7F */
    case gcSHADER_UINT16_X32:                      return "gcSHADER_UINT16_X32";                    /* 0x80 */

    /* short vectors */
    case gcSHADER_INT16_X1:                        return "gcSHADER_INT16_X1";                      /* 0x81 */
    case gcSHADER_INT16_X2:                        return "gcSHADER_INT16_X2";                      /* 0x82 */
    case gcSHADER_INT16_X3:                        return "gcSHADER_INT16_X3";                      /* 0x83 */
    case gcSHADER_INT16_X4:                        return "gcSHADER_INT16_X4";                      /* 0x84 */
    case gcSHADER_INT16_X8:                        return "gcSHADER_INT16_X8";                      /* 0x85 */
    case gcSHADER_INT16_X16:                       return "gcSHADER_INT16_X16";                     /* 0x86 */
    case gcSHADER_INT16_X32:                       return "gcSHADER_INT16_X32";                     /* 0x87 */

    /* packed data type */
    /* packed float16 (2 bytes per element) */
    case gcSHADER_FLOAT16_P2:                      return "gcSHADER_FLOAT16_P2";                    /* 0x88 half2 */
    case gcSHADER_FLOAT16_P3:                      return "gcSHADER_FLOAT16_P3";                    /* 0x89 half3 */
    case gcSHADER_FLOAT16_P4:                      return "gcSHADER_FLOAT16_P4";                    /* 0x8A half4 */
    case gcSHADER_FLOAT16_P8:                      return "gcSHADER_FLOAT16_P8";                    /* 0x8B half8 */
    case gcSHADER_FLOAT16_P16:                     return "gcSHADER_FLOAT16_P16";                   /* 0x8C half16 */
    case gcSHADER_FLOAT16_P32:                     return "gcSHADER_FLOAT16_P32";                   /* 0x8D half32 */

    /* packed boolean (1 byte per element) */
    case gcSHADER_BOOLEAN_P2:                      return "gcSHADER_BOOLEAN_P2";                    /* 0x8E bool2 bvec2 */
    case gcSHADER_BOOLEAN_P3:                      return "gcSHADER_BOOLEAN_P3";                    /* 0x8F */
    case gcSHADER_BOOLEAN_P4:                      return "gcSHADER_BOOLEAN_P4";                    /* 0x90 */
    case gcSHADER_BOOLEAN_P8:                      return "gcSHADER_BOOLEAN_P8";                    /* 0x91 */
    case gcSHADER_BOOLEAN_P16:                     return "gcSHADER_BOOLEAN_P16";                   /* 0x92 */
    case gcSHADER_BOOLEAN_P32:                     return "gcSHADER_BOOLEAN_P32";                   /* 0x93 */

    /* uchar vectors (1 byte per element) */
    case gcSHADER_UINT8_P2:                        return "gcSHADER_UINT8_P2";                      /* 0x94 */
    case gcSHADER_UINT8_P3:                        return "gcSHADER_UINT8_P3";                      /* 0x95 */
    case gcSHADER_UINT8_P4:                        return "gcSHADER_UINT8_P4";                      /* 0x96 */
    case gcSHADER_UINT8_P8:                        return "gcSHADER_UINT8_P8";                      /* 0x97 */
    case gcSHADER_UINT8_P16:                       return "gcSHADER_UINT8_P16";                     /* 0x98 */
    case gcSHADER_UINT8_P32:                       return "gcSHADER_UINT8_P32";                     /* 0x99 */

    /* char vectors (1 byte per element) */
    case gcSHADER_INT8_P2:                         return "gcSHADER_INT8_P2";                       /* 0x9A */
    case gcSHADER_INT8_P3:                         return "gcSHADER_INT8_P3";                       /* 0x9B */
    case gcSHADER_INT8_P4:                         return "gcSHADER_INT8_P4";                       /* 0x9C */
    case gcSHADER_INT8_P8:                         return "gcSHADER_INT8_P8";                       /* 0x9D */
    case gcSHADER_INT8_P16:                        return "gcSHADER_INT8_P16";                      /* 0x9E */
    case gcSHADER_INT8_P32:                        return "gcSHADER_INT8_P32";                      /* 0x9F */

    /* ushort vectors (2 bytes per element) */
    case gcSHADER_UINT16_P2:                       return "gcSHADER_UINT16_P2";                     /* 0xA0 */
    case gcSHADER_UINT16_P3:                       return "gcSHADER_UINT16_P3";                     /* 0xA1 */
    case gcSHADER_UINT16_P4:                       return "gcSHADER_UINT16_P4";                     /* 0xA2 */
    case gcSHADER_UINT16_P8:                       return "gcSHADER_UINT16_P8";                     /* 0xA3 */
    case gcSHADER_UINT16_P16:                      return "gcSHADER_UINT16_P16";                    /* 0xA4 */
    case gcSHADER_UINT16_P32:                      return "gcSHADER_UINT16_P32";                    /* 0xA5 */

    /* short vectors (2 bytes per element) */
    case gcSHADER_INT16_P2:                        return "gcSHADER_INT16_P2";                      /* 0xA6 */
    case gcSHADER_INT16_P3:                        return "gcSHADER_INT16_P3";                      /* 0xA7 */
    case gcSHADER_INT16_P4:                        return "gcSHADER_INT16_P4";                      /* 0xA8 */
    case gcSHADER_INT16_P8:                        return "gcSHADER_INT16_P8";                      /* 0xA9 */
    case gcSHADER_INT16_P16:                       return "gcSHADER_INT16_P16";                     /* 0xAA */
    case gcSHADER_INT16_P32:                       return "gcSHADER_INT16_P32";                     /* 0xAB */

    case gcSHADER_INTEGER_X8:                      return "gcSHADER_INTEGER_X8";                    /* 0xAC */
    case gcSHADER_INTEGER_X16:                     return "gcSHADER_INTEGER_X16";                   /* 0xAD */
    case gcSHADER_UINT_X8:                         return "gcSHADER_UINT_X8";                       /* 0xAE */
    case gcSHADER_UINT_X16:                        return "gcSHADER_UINT_X16";                      /* 0xAF */
    case gcSHADER_FLOAT_X8:                        return "gcSHADER_FLOAT_X8";                      /* 0xB0 */
    case gcSHADER_FLOAT_X16:                       return "gcSHADER_FLOAT_X16";                     /* 0xB1 */
    case gcSHADER_INT64_X8:                        return "gcSHADER_INT64_X8";                      /* 0xB2 */
    case gcSHADER_INT64_X16:                       return "gcSHADER_INT64_X16";                     /* 0xB3 */
    case gcSHADER_UINT64_X8:                       return "gcSHADER_UINT64_X8";                     /* 0xB4 */
    case gcSHADER_UINT64_X16:                      return "gcSHADER_UINT64_X16";                    /* 0xB5 */

    default:
    gcmASSERT(0);
    return "Invalid";
    }
}

gctCONST_STRING
gcGetDataTypeName(
IN cloCOMPILER Compiler,
IN clsGEN_CODE_DATA_TYPE DataType
)
{
  gcsTYPE_SIZE typeSize;

  typeSize = clConvToShaderDataType(Compiler, DataType);
  return gcGetShaderDataTypeName(typeSize.type);
}

static gctCONST_STRING
_GetFormatName(
IN gcSL_FORMAT Format
)
{
    gcSL_FORMAT format;

    format = GetFormatBasicType(Format);
    if(isFormatSpecialType(Format))
    {
        format = GetFormatSpecialType(Format);
    }

    switch (format) {
    case gcSL_FLOAT:    return "gcSL_FLOAT";
    case gcSL_FLOAT16:  return "gcSL_FLOAT16";
    case gcSL_FLOAT64:  return "gcSL_FLOAT64";
    case gcSL_INTEGER:  return "gcSL_INTEGER";
    case gcSL_INT64:    return "gcSL_INT64";
    case gcSL_INT8:     return "gcSL_INT8";
    case gcSL_INT16:    return "gcSL_INT16";
